Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo_freertos/firmware/src/packs/PIC32CX2051MTC128_DFP/component/ipc.h
/** \brief IPC register offsets definitions */
#define IPC_ISCR_REG_OFST              _UINT32_(0x00)      /* (IPC_ISCR) Interrupt Set Command Register Offset */
#define IPC_ICCR_REG_OFST              _UINT32_(0x04)      /* (IPC_ICCR) Interrupt Clear Command Register Offset */
#define IPC_IPR_REG_OFST               _UINT32_(0x08)      /* (IPC_IPR) Interrupt Pending Register Offset */
#define IPC_IECR_REG_OFST              _UINT32_(0x0C)      /* (IPC_IECR) Interrupt Enable Command Register Offset */
#define IPC_IDCR_REG_OFST              _UINT32_(0x10)      /* (IPC_IDCR) Interrupt Disable Command Register Offset */
#define IPC_IMR_REG_OFST               _UINT32_(0x14)      /* (IPC_IMR) Interrupt Mask Register Offset */
#define IPC_ISR_REG_OFST               _UINT32_(0x18)      /* (IPC_ISR) Interrupt Status Register Offset */
#define IPC_WPMR_REG_OFST              _UINT32_(0x1C)      /* (IPC_WPMR) Write Protection Mode Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief IPC register API structure */
typedef struct
{
  __O   uint32_t                       IPC_ISCR;           /**< Offset: 0x00 ( /W  32) Interrupt Set Command Register */
  __O   uint32_t                       IPC_ICCR;           /**< Offset: 0x04 ( /W  32) Interrupt Clear Command Register */
  __I   uint32_t                       IPC_IPR;            /**< Offset: 0x08 (R/   32) Interrupt Pending Register */
  __O   uint32_t                       IPC_IECR;           /**< Offset: 0x0C ( /W  32) Interrupt Enable Command Register */
  __O   uint32_t                       IPC_IDCR;           /**< Offset: 0x10 ( /W  32) Interrupt Disable Command Register */
  __I   uint32_t                       IPC_IMR;            /**< Offset: 0x14 (R/   32) Interrupt Mask Register */
  __I   uint32_t                       IPC_ISR;            /**< Offset: 0x18 (R/   32) Interrupt Status Register */
  __IO  uint32_t                       IPC_WPMR;           /**< Offset: 0x1C (R/W  32) Write Protection Mode Register */
} ipc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CXMTC_IPC_COMPONENT_H_ */
